#Requires AutoHotkey v2.0

; ======================================================
; 短语缩写
; ======================================================
::155::15542518680
::xialin::xialin.luo@sbitech.com
::luoxia::luoxialin@gmail.com


; ======================================================
; 组合键映射: 方向键
; ======================================================
^h::SendInput "{Left}"
^j::SendInput "{Down}"
^k::SendInput "{Up}"
^l::SendInput "{Right}"
^e::SendInput "{End}"
^i::SendInput "{Home}"



; ======================================================
; 组合键映射: 空格键
; ======================================================
~Space & c::SendInput "^c"


; ======================================================
; 单键映射
; ======================================================
RWin::Backspace



; ======================================================
; 启动程序
; ======================================================
TargetProgram := "C:\Users\xialin.luo\Documents\app\terminal-1.24.10621.0\WindowsTerminal"
; 定义左 Alt 键 (~ 表示不拦截 Alt 原有的系统功能，避免 Alt 单击失效)
~LAlt Up::
{
    ; 等待 LAlt 再次被按下，超时时间设为 0.2 秒
    ; 如果 0.2 秒内再次按下了 LAlt，KeyWait 会返回 1 (True)
    if KeyWait("LAlt", "D T0.2")
    {
        ; --- 在这里修改你想要启动的程序路径 ---
        Run TargetProgram
        
        ; 等待按键松开，防止长按导致重复触发
        KeyWait "LAlt"
    }
}



; ======================================================
; 安住空格键表示触发ctrl键, 点击空格表示空格键
; ======================================================
; * 号允许组合修饰键，$ 号防止递归触发
*$Space::
{
    ; 逻辑按下左 Ctrl
    Send("{Blind}{LCtrl DownR}")
    
    ; 等待 Space 键释放
    KeyWait("Space")
    
    ; 逻辑抬起左 Ctrl
    Send("{Blind}{LCtrl Up}")
    
    ; 核心逻辑：如果从按下 Space 到释放期间没有按过其他键，则发送空格
    if (A_PriorKey = "Space")
    {
        Send("{Blind}{Space}")
    }
}
